export const text = `Вопрос с «Wikileaks syndrome», таким образом, был решен — поскольку у системы отсутствовал живой оператор, некому было бояться ответственности за ошибку или вырвавшуюся в горячке боя неполиткорректность. Однако на смену одной проблеме тут же пришла другая.

Дело в том, что раньше в случае гражданских жертв можно было предъявить негодующей общественности какой-нибудь разъяснительный документ — например, расшифровку переговоров оператора с его непосредственным командиром. После этого становились понятны причины трагедии. Обыкновенно оставалась и видеозапись, где было видно, что телекамеру на плече журналиста или бревно на спине рабочего действительно можно принять за гранатомет или портативную ракету «земля-воздух». Словом, человеческую ошибку всегда можно было смягчить, показав ее неумышленность.

Новая система управления не давала такой возможности. И, хоть вероятность того, что «Freedom Liberator» откроет стрельбу по человеку с бревном на плече, стала значительно меньше, информационная чернота происходящего оказалась крайне неблагоприятным пиар-фактором. И Пентагон дал инженерам дополнительное задание — сделать работу системы открытой для внешнего наблюдателя, в удобной и наглядной форме демонстрируя, как именно принималось то или иное решение. Причем ясно это должно было быть не только специалисту, но и любому налогоплательщику.

Именно при выполнении этого заказа и проявились во всем блеске возможности системы.

Поскольку «Free D.O.M.» воспроизводила механизмы работы человеческого мозга, отчет о ее работе нетрудно было представить в понятной человеку форме. Проблема заключалась в выборе этой формы. И у инженеров Кремниевой долины родилась поистине гениальная мысль.

Они рассуждали примерно так: если система состоит из параллельных нейронных сетей, каждая из которых имитирует отдельного человека, почему бы не представить отчет о ее работе в виде диалога нескольких виртуальных персонажей, каждый из которых объяснял бы общественности свою точку зрения?

Любой из этих персонажей был просто репрезентацией боевого канала обработки информации. Но, затратив совсем немного машинных ресурсов, ничего не стоило придать ему человеческий вид и перевести язык его внутренних кодов в человеческую речь.

Можно было даже оформить весь отчет в виде симпатичного мультика вроде «Симпсонов». Это практически не отражалось на работе системы — по сравнению с боевыми вычислениями, которыми она занималась, такая антропоморфизация была детской игрой. Нейронной сети, способной имитировать действия боевых пилотов, ничего не стоило заодно смоделировать и ток-шоу.

Проблема «человеческого опыта» была и в этом случае решена просто и элегантно: в систему загрузили архив всех американских телевизионных ток-шоу — то есть всех вообще. Используя свои базовые алгоритмы, «F.D.O.M.» могла выбирать из огромного богатства уже произнесенных реплик, и даже модифицировать их, создавая потрясающий эффект живого человеческого присутствия. На пике нагрузки это отнимало не больше двух процентов общей мощности системы, которая имела запас около десяти процентов.

Теперь «F.D.O.M.» выдавала видеоотчет. Выглядел он так: у большого монитора в условном подобии студии сидели несколько виртуальных фигурок простецкого вида (каждый раз система моделировала их заново, чтобы не создавать впечатления, будто у нее внутри обитают некие искусственные существа). Картинка, на которую смотрели фигурки, соответствовала тому, что видели камеры «Либерейтора». При появлении врагов фигурки просыпались и вступали в диалог, напоминающий эмоциональное ток-шоу категории «B».

Вряд ли такая передача выдержала бы конкуренцию на телевидении. Но в смысле public relations смоделированный подобным образом диалог чрезвычайно выгодно отличался от переговоров живых операторов.

Военные обычно говорили коротко и по делу:

— Долбани-ка еще раз вон по тому ублюдку в канаве.

А виртуальные фигурки в той же ситуации изъяснялись так:

— Ужасно, что приходится открывать огонь по живому человеку. Но когда я думаю о наших ребятах, в которых может попасть пущенная им пуля, когда я думаю, что он может прятать в кармане гранату или пистолет, я понимаю — этот трудный, практически невозможный выбор все-таки придется сделать…

Хитрость Пентагона заключалась в том, что сгенерированные подобным образом виртуальные отчеты не навязывались общественности — они хранились в военном архиве и имели статус секретной информации. Но если какой-нибудь свисткодув из числа военных решался слить информацию на «Wikileaks» или в другие СМИ, те получали вместо жареного компромата патетическое ток-шоу, где все принимаемые решения были настолько безупречны с нравственной точки зрения, что никакой возможности обвинить в смерти гражданских лиц кого-то, кроме мертвых гражданских лиц, просто не оставалось.

Была еще одна немаловажная деталь. Тридцатимиллиметровая пушка дрона стреляла со скоростью шестьсот выстрелов в минуту. Поскольку в боевых условиях система «F.D.O.M.» проводила анализ оперативной обстановки с очень высокой тактовой частотой, ток-шоу в полном объеме пересчитывалось после каждого выстрела (всякий раз с новыми виртуальными персонажами). Эти вычисления занимали у нейронной сети ничтожнейшую долю секунды, но в человеческом масштабе времени такая программа шла около часа. Результат был шокирующим.

Если, допустим, пушка давала очередь в триста снарядов по какому-нибудь бензовозу или минивэну, то желающему понять случившееся во всей полноте приходилось смотреть триста часов довольно нудного материала, где приблизительные персонажи, смутно похожие на кассиров Волмарта, парковщиков машин, страховых агентов и прочих парней с соседней улицы, раз за разом принимали решение открыть огонь — и всякий раз после такой мучительной эмоциональной борьбы, что любой непредубежденный зритель ясно видел: иначе было нельзя. А если пушка стреляла минуту, то свисткодувам приходилось вывешивать на ютуб шестьсот часов катарсиса, гуманизма и человечности самой высокой пробы.

Разрешение, правда, было обычно небольшим — все-таки военная система не могла бросаться ресурсами как попало.

7
Понятно, что вместе с такой эволюцией бортового вычислительного комплекса менялся и сам летательный аппарат, поскольку постоянно расширялся круг задач, который могла решать система.

«Либерейтор» первого поколения был просто утяжеленной версией дрона «MQ-9 „Reaper“», способной брать на борт больше ракет и топлива. Затем было признано нецелесообразным тратить дорогие ракеты, чтобы сжечь стоящую в пустыне палатку и убить привязанного рядом верблюда. На дрон была установлена пушка — сначала двадцати-, а затем тридцатимиллиметровая.

Потом к самолету стали подвешивать сбрасываемые контейнеры с грузом: боеприпасами, медикаментами, продовольствием и едой — система управления могла опознать ситуацию, когда солдатам на земле нужна была помощь.

После того как наземные войска были резко сокращены в числе, а затем и вообще выведены из районов патрулирования дронов, функция доставки груза превратилась из боевой в гуманитарную и, чего уж там таить, пропагандистскую.

Летательный аппарат теперь мог сбросить пару одеял и бутылку виски поселянам, чья маковая плантация была сожжена враждебным феодальным кланом. Он мог доставить груз учебников на местном наречии, напоминая аборигенам, что скоро начнется учебный год и детишкам пора в школу — а в качестве подарка добавить набор шоколадок, пару футбольных мячей и несколько маленьких радиоприемников.

Стоит ли говорить, что утечки информации с каждым годом становились все трогательнее, и самые проницательные наблюдатели уже спорили, как именно финансируется «Wikileaks» — по линии ЦРУ или через бюджет Пентагона.

Большую часть наземных войск США удалось вывести из зоны тлеющих конфликтов не в последнюю очередь потому, что появилась возможность решать проблемы с воздуха в автоматическом режиме. Благодаря системе «Free D.O.M.» даже самая маленькая группа инсургентов, решившая собраться где-нибудь на открытой местности с оружием в руках, была обречена. В то же время случаи гибели гражданских лиц из-за ошибочных авиаударов практически сошли на нет.

К этому времени боевой дрон «Liberator IV» (так называлась последняя модификация) представлял собой тяжелый четырехмоторный аппарат, по габаритам близкий к транспортнику C-130 «Геркулес». Он мог находиться в воздухе 15–20 часов, брал на борт уйму гуманитарного груза, двадцать ракет «Hellfire», немыслимое число патронов к тридцатимиллиметровой пушке — и, разумеется, был оснащен зоркими телекамерами, видящими сквозь туман, дымку и ночь.

Цивилизация имела право торжествовать победу. А если у нее возникали сомнения, она всегда могла поглядеться в просчитанное системой «Free D.O.M.» зеркало, висящее на «Wikileaks», и убедиться, что она прекрасна как никогда.

Так обстояли дела, когда в Афганистане появился Савелий Скотенков — в новенькой зеленой чалме и с красной от хны бородою.`
export const playerIds = [
  '8109483c-52e5-46c1-8422-70c26c0fe8a3',
  'e7dbc287-7691-4c12-a6d5-2ed18d794aba',
  '94ddfe17-b9fd-4304-bc5b-fb3338ae2f4f',
  '956c8df5-abcc-4ee4-aa2a-83ad08c300b8',
  '02d4edea-c570-4a2c-b43d-88b16e5825fc',
  'e8831d4f-8e17-4bd7-95fc-7b2e9898bb99',
  'd8b46e2c-4b7b-4065-9378-5aa89eefbf92',
  '35bea86c-c96b-4385-9092-7cbe769d9001',
  'bb03c55e-5f25-405b-86c3-2d7e8d67cf1f',
  '2088261f-39ba-4391-9034-e602c34aa5cd',
]
export const deskIds = [
  '3524583d-4426-4776-9669-9fd4ab638314',
  '8d3bdfca-109e-41b8-a91c-8a82fd5de800',
  'da6836c1-f4ea-4102-8e6f-4ba3b8c9ba81',
  'a1272a78-b3e7-4850-b154-48278110184e',
  '421cd72d-11f2-480c-9503-c0f060bcf3c0',
  '39e48ae6-1800-4b7f-8c3f-9777e767ae5b',
  '353e182b-a772-486c-b27d-c4549345dced',
  'd9bed5a0-74c7-412e-9971-f6218ed519b8',
  'd4b0d1d5-72a9-43dc-802a-387252a4c687',
  '19e11550-b2c9-4cc3-972c-0537bcda5285',
]